Revit 2024 API
AreaBasedLoadData.ApparentPowerDensity Property
 The apparent power density of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double ApparentPowerDensity { get; }
Visual Basic
Public ReadOnly Property ApparentPowerDensity As Double
	Get
Visual C++
public:
property double ApparentPowerDensity {
	double get ();
}
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace